
** Create Customer User

The steps below are not strictly necessary. They are provided so you
or the customer can do testing. Note that these are executed by the
customer so they use =--profile $CUSTOMER_PROFILE=. We create an IAM
user on the customer side for testing reading and writing to the
customer's bucket:
#+NAME: setup-customer-user
#+BEGIN_SRC sh :session aws :results drawer
aws --profile $CUSTOMER_PROFILE iam create-user \
  --user-name ${CUSTOMER_USER} | tee /tmp/customer-user.json
#+END_SRC

#+RESULTS: setup-customer-user
:results:
{
    "User": {
        "Path": "/",
        "UserName": "test-customer",
        "UserId": REDACTED,
        "Arn": "arn:aws:iam::REDACTED:user/test-customer",
        "CreateDate": "2023-09-12T03:27:24Z"
    }
}
:end:

Next we will create credentials for the customer user:

#+NAME: create-access-key-customer-user
#+BEGIN_SRC sh :session aws :results drawer 
aws --profile ${CUSTOMER_PROFILE} iam create-access-key \
  --user-name ${CUSTOMER_USER} | tee /tmp/creds_customer_user.json
#+END_SRC

#+RESULTS: create-access-key-customer-user
:results:
{
    "AccessKey": {
        "UserName": "test-customer",
        "AccessKeyId": REDACTED,
        "Status": "Active",
        "SecretAccessKey": REDACTED,
        "CreateDate": "2023-09-12T03:27:50Z"
    }
}
:end:

Now we can create the policy for the bucket so that the customer's IAM user can
read/write files to the bucket (note that this *overwrites* the
previously applied =policy-for-firm-root.json= so we will need to add
that back after testing):
#+NAME: setup-aws-policy-for-customer
#+BEGIN_SRC sh :session aws :results drawer
cat > /tmp/policy.json<<EOF
{
   "Version": "2012-10-17",
   "Statement": [
      {
         "Sid": "statement1",
         "Effect": "Allow",
         "Principal": {
            "AWS": "arn:aws:iam::${CUSTOMER_AWS_ACCT}:user/${CUSTOMER_USER}"
         },
         "Action": [
            "s3:GetBucketLocation",
            "s3:ListBucket"
         ],
         "Resource": [
            "arn:aws:s3:::${BUCKET}"
         ]
      },
      {
         "Sid": "statement2",
         "Effect": "Allow",
         "Principal": {
            "AWS": "arn:aws:iam::${CUSTOMER_AWS_ACCT}:user/${CUSTOMER_USER}"
         },
         "Action": [
             "s3:GetObject",
             "s3:PutObject",
             "s3:PutObjectAcl"
         ],
         "Resource": [
            "arn:aws:s3:::${BUCKET}/*"
         ]
      }
   ]
}
EOF
#+END_SRC

Now apply policy so customer can access bucket:
#+NAME: apply-aws-customer-bucket-policy
#+BEGIN_SRC sh :session aws :results drawer
aws --profile ${CUSTOMER_PROFILE} s3api put-bucket-policy \
  --bucket $BUCKET --policy file:///tmp/policy.json
#+END_SRC


Verify customer can write to the bucket
#+NAME: test-customer-write-bucket
#+BEGIN_SRC sh :session aws :results output drawer
echo "Example file with date `date`" > /tmp/example-file.txt
AWS_ACCESS_KEY_ID=`jq -r .AccessKey.AccessKeyId /tmp/creds_customer_user.json` \
  AWS_SECRET_ACCESS_KEY=`jq -r .AccessKey.SecretAccessKey /tmp/creds_customer_user.json` \
  aws s3api put-object --bucket $BUCKET --key example-file.txt \
  --body /tmp/example-file.txt
AWS_ACCESS_KEY_ID=`jq -r .AccessKey.AccessKeyId /tmp/creds_customer_user.json` \
  AWS_SECRET_ACCESS_KEY=`jq -r .AccessKey.SecretAccessKey /tmp/creds_customer_user.json` \
  aws s3api get-object --bucket $BUCKET --key example-file.txt /tmp/out.txt
cat /tmp/out.txt
#+END_SRC

#+RESULTS: test-customer-write-bucket
:results:
{
    "ETag": "\"3a814e81f659bf56227b726b7c7fe2b2\"",
    "ServerSideEncryption": "AES256"
}
{
    "AcceptRanges": "bytes",
    "LastModified": "Tue, 12 Sep 2023 03:36:41 GMT",
    "ContentLength": 52,
    "ETag": "\"3a814e81f659bf56227b726b7c7fe2b2\"",
    "ContentType": "binary/octet-stream",
    "ServerSideEncryption": "AES256",
    "Metadata": {}
}
Example file with date Mon Sep 11 23:36:40 EDT 2023
:end:

Now that our testing is done, add back the policy for the firm root:
#+NAME: apply-aws-writer-bucket-policy
#+BEGIN_SRC sh :session aws :results drawer 
aws --profile ${CUSTOMER_PROFILE} s3api put-bucket-policy \
  --bucket $BUCKET --policy file:///tmp/policy-for-firm-root.json
#+END_SRC


** Create Firm User and Policy

In this section we create an IAM user account in the firm's AWS
account that can access the customer's bucket. Note that most of these
commands use =--profile ${FIRM_PROFILE}= since they are executing in
the firm's AWS account.

Generally you would only need to create this firm user once. For this
setup, you would need to apply the policy to the firm user for each
customer bucket or create a more sophisticated policy with wild cards
that would apply to all customer buckets but that is beyond the scope
of this article.

Now we make an IAM account for your firm who can write to the desired
bucket:
#+NAME: aws-make-writer-user
#+BEGIN_SRC sh :session aws :results drawer
aws --profile ${FIRM_PROFILE} iam create-user \
  --user-name $FIRM_IAM_USER | tee /tmp/writer-user.json
#+END_SRC

#+RESULTS: aws-make-writer-user
:results:
{
    "User": {
        "Path": "/",
        "UserName": "test-writer",
        "UserId": REDACTED,
        "Arn": "arn:aws:iam::REDACTED:user/test-writer",
        "CreateDate": "2023-09-12T03:39:13Z"
    }
}
:end:

Now we create access keys for the new user:
#+NAME: create-access-key-for-writer
#+BEGIN_SRC sh :session aws :results drawer :exports code
aws --profile ${FIRM_PROFILE} iam create-access-key \
  --user-name $FIRM_IAM_USER | tee /tmp/writer-creds.json
#+END_SRC

#+RESULTS: create-access-key-for-writer
:results:
{
    "AccessKey": {
        "UserName": "test-writer",
        "AccessKeyId": REDACTED,
        "Status": "Active",
        "SecretAccessKey": REDACTED,
        "CreateDate": "2023-09-12T03:39:43Z"
    }
}
:end:


Now we setup a policy for the firm's non-root user so it can access
the bucket which root has been granted access to buy the customer.
#+NAME: setup-aws-policy-for-iam-user
#+BEGIN_SRC sh :session aws :results drawer
cat > /tmp/writer-policy-iam.json<<EOF
{
   "Version": "2012-10-17",
   "Statement": [
      {
         "Sid": "allowwriteruseriamaccess",
         "Effect": "Allow",
         "Action": [
            "s3:ListBucket",
            "s3:GetObject",
            "s3:PutObject",
            "s3:PutObjectAcl"
         ],
         "Resource": [
            "arn:aws:s3:::${BUCKET}",
            "arn:aws:s3:::${BUCKET}/*"
         ]
      }
   ]
}
EOF
#+END_SRC


Now we apply the policy where the firm's admin is granting access to
the non-root =$FIRM_IAM_USER=.
#+NAME: apply-aws-policy-for-iam-writer-user
#+BEGIN_SRC sh :session aws :results drawer
aws --profile ${FIRM_PROFILE} \
  iam put-user-policy --user-name $FIRM_IAM_USER --policy-name writer-policy \
  --policy-document file:///tmp/writer-policy-iam.json
#+END_SRC


Now we test writing and reading.
#+NAME: test-write-bucket-from-writer
#+BEGIN_SRC sh :session aws :results drawer
rm -f /tmp/out.txt
echo "Example file with date `date`" > /tmp/example-file.txt
AWS_ACCESS_KEY_ID=`jq -r .AccessKey.AccessKeyId /tmp/writer-creds.json` \
  AWS_SECRET_ACCESS_KEY=`jq -r .AccessKey.SecretAccessKey /tmp/writer-creds.json` \
  aws s3api put-object --bucket $BUCKET --key example-file.txt \
  --body /tmp/example-file.txt
AWS_ACCESS_KEY_ID=`jq -r .AccessKey.AccessKeyId /tmp/writer-creds.json` \
  AWS_SECRET_ACCESS_KEY=`jq -r .AccessKey.SecretAccessKey /tmp/writer-creds.json` \
  aws s3api get-object --bucket $BUCKET --key example-file.txt /tmp/out.txt
cat /tmp/out.txt
#+END_SRC

#+RESULTS: test-write-bucket-from-writer
:results:
{
    "ETag": "\"72c3d88e933305e734e625fd5f3a465d\"",
    "ServerSideEncryption": "AES256"
}
{
    "AcceptRanges": "bytes",
    "LastModified": "Tue, 12 Sep 2023 03:53:44 GMT",
    "ContentLength": 52,
    "ETag": "\"72c3d88e933305e734e625fd5f3a465d\"",
    "ContentType": "binary/octet-stream",
    "ServerSideEncryption": "AES256",
    "Metadata": {}
}
Example file with date Mon Sep 11 23:53:43 EDT 2023
:end:

